**DATA SAMPLING**

In [ ]:
import pandas as pd

:

In [2]:
data = pd.read_csv("Car Dataset.csv")

In [3]:
data.head()

          Car        Model   Volume   Weight   CO2
0      Toyota         Aygo      1000      790    99
1  Mitsubishi   Space Star      1200     1160    95
2       Skoda       Citigo      1000      929    95
3        Fiat           500      900      865    90
4        Mini       Cooper      1500     1140   105

In [4]:
row1 = data.sample(n=1)
row1

      Car  Model   Volume   Weight   CO2
0  Toyota   Aygo      1000      790    99

In [5]:
row5 = data.sample(n=5)
row5

           Car        Model   Volume   Weight   CO2
29         BMW             5     2000     1705   114
14      Hundai          I30      1600     1326    97
9         Audi           A1      1600     1150    99
1   Mitsubishi   Space Star      1200     1160    95
24       Volvo          S60      2000     1415    99

In [6]:
column1 = data['Model '].sample(n=4)
column1

1     Space Star
24           S60
22       C-Class
0           Aygo
Name: Model , dtype: object